QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EA32def.inc
; CRCSCAN_CTRLA masks
.equ CRCSCAN_ENABLE_bm = 0x01            ; Enable CRC scan bit mask
.equ CRCSCAN_ENABLE_bp = 0               ; Enable CRC scan bit position
.equ CRCSCAN_NMIEN_bm = 0x02             ; Enable NMI Trigger bit mask
.equ CRCSCAN_NMIEN_bp = 1                ; Enable NMI Trigger bit position
.equ CRCSCAN_RESET_bm = 0x80             ; Reset CRC scan bit mask
.equ CRCSCAN_RESET_bp = 7                ; Reset CRC scan bit position

; CRCSCAN_CTRLB masks
.equ CRCSCAN_SRC_gm = 0x03               ; CRC Source group mask
.equ CRCSCAN_SRC_gp = 0                  ; CRC Source group position
.equ CRCSCAN_SRC_0_bm = (1<<0)           ; CRC Source bit 0 mask
.equ CRCSCAN_SRC_0_bp = 0                ; CRC Source bit 0 position
.equ CRCSCAN_SRC_1_bm = (1<<1)           ; CRC Source bit 1 mask
.equ CRCSCAN_SRC_1_bp = 1                ; CRC Source bit 1 position

; CRCSCAN_STATUS masks
.equ CRCSCAN_BUSY_bm = 0x01              ; CRC Busy bit mask
.equ CRCSCAN_BUSY_bp = 0                 ; CRC Busy bit position
.equ CRCSCAN_OK_bm = 0x02                ; CRC Ok bit mask
.equ CRCSCAN_OK_bp = 1                   ; CRC Ok bit position

; CRC Source select
.equ CRCSCAN_SRC_FLASH_gc = (0x00<<0)    ; CRC on entire flash
.equ CRCSCAN_SRC_APPLICATION_gc = (0x01<<0) ; CRC on boot and appl section of flash
.equ CRCSCAN_SRC_BOOT_gc = (0x02<<0)     ; CRC on boot section of flash


;*************************************************************************
;** DAC - Digital to Analog Converter
;*************************************************************************

; DAC_CTRLA masks
.equ DAC_ENABLE_bm = 0x01                ; DAC Enable bit mask
.equ DAC_ENABLE_bp = 0                   ; DAC Enable bit position
.equ DAC_OUTRANGE_gm = 0x30              ; Output Buffer Range group mask
.equ DAC_OUTRANGE_gp = 4                 ; Output Buffer Range group position
.equ DAC_OUTRANGE_0_bm = (1<<4)          ; Output Buffer Range bit 0 mask
.equ DAC_OUTRANGE_0_bp = 4               ; Output Buffer Range bit 0 position
.equ DAC_OUTRANGE_1_bm = (1<<5)          ; Output Buffer Range bit 1 mask
.equ DAC_OUTRANGE_1_bp = 5               ; Output Buffer Range bit 1 position
.equ DAC_OUTEN_bm = 0x40                 ; Output Buffer Enable bit mask
.equ DAC_OUTEN_bp = 6                    ; Output Buffer Enable bit position
.equ DAC_RUNSTDBY_bm = 0x80              ; Run in Standby Mode bit mask
.equ DAC_RUNSTDBY_bp = 7                 ; Run in Standby Mode bit position

; DAC_DATA masks
.equ DAC_DATA_gm = 0xFFC0                ; Data group mask
.equ DAC_DATA_gp = 6                     ; Data group position
.equ DAC_DATA_0_bm = (1<<6)              ; Data bit 0 mask
.equ DAC_DATA_0_bp = 6                   ; Data bit 0 position
.equ DAC_DATA_1_bm = (1<<7)              ; Data bit 1 mask
.equ DAC_DATA_1_bp = 7                   ; Data bit 1 position
.equ DAC_DATA_2_bm = (1<<8)              ; Data bit 2 mask
.equ DAC_DATA_2_bp = 8                   ; Data bit 2 position
.equ DAC_DATA_3_bm = (1<<9)              ; Data bit 3 mask
.equ DAC_DATA_3_bp = 9                   ; Data bit 3 position
.equ DAC_DATA_4_bm = (1<<10)             ; Data bit 4 mask
.equ DAC_DATA_4_bp = 10                  ; Data bit 4 position
.equ DAC_DATA_5_bm = (1<<11)             ; Data bit 5 mask
.equ DAC_DATA_5_bp = 11                  ; Data bit 5 position
.equ DAC_DATA_6_bm = (1<<12)             ; Data bit 6 mask
.equ DAC_DATA_6_bp = 12                  ; Data bit 6 position
.equ DAC_DATA_7_bm = (1<<13)             ; Data bit 7 mask
.equ DAC_DATA_7_bp = 13                  ; Data bit 7 position
.equ DAC_DATA_8_bm = (1<<14)             ; Data bit 8 mask
.equ DAC_DATA_8_bp = 14                  ; Data bit 8 position
.equ DAC_DATA_9_bm = (1<<15)             ; Data bit 9 mask
.equ DAC_DATA_9_bp = 15                  ; Data bit 9 position

; Output Buffer Range select
.equ DAC_OUTRANGE_AUTO_gc = (0x00<<4)    ; Output buffer automatically choose best range
.equ DAC_OUTRANGE_LOW_gc = (0x02<<4)     ; Output buffer configured to low range
.equ DAC_OUTRANGE_HIGH_gc = (0x03<<4)    ; Output buffer configured to high range


;*************************************************************************
;** EVSYS - Event System
;*************************************************************************

; EVSYS_SWEVENTA masks
.equ EVSYS_SWEVENTA_gm = 0xFF            ; Software event on channel select group mask
.equ EVSYS_SWEVENTA_gp = 0               ; Software event on channel select group position
.equ EVSYS_SWEVENTA_0_bm = (1<<0)        ; Software event on channel select bit 0 mask
.equ EVSYS_SWEVENTA_0_bp = 0             ; Software event on channel select bit 0 position
.equ EVSYS_SWEVENTA_1_bm = (1<<1)        ; Software event on channel select bit 1 mask
.equ EVSYS_SWEVENTA_1_bp = 1             ; Software event on channel select bit 1 position
.equ EVSYS_SWEVENTA_2_bm = (1<<2)        ; Software event on channel select bit 2 mask
.equ EVSYS_SWEVENTA_2_bp = 2             ; Software event on channel select bit 2 position
.equ EVSYS_SWEVENTA_3_bm = (1<<3)        ; Software event on channel select bit 3 mask
.equ EVSYS_SWEVENTA_3_bp = 3             ; Software event on channel select bit 3 position
.equ EVSYS_SWEVENTA_4_bm = (1<<4)        ; Software event on channel select bit 4 mask
.equ EVSYS_SWEVENTA_4_bp = 4             ; Software event on channel select bit 4 position
.equ EVSYS_SWEVENTA_5_bm = (1<<5)        ; Software event on channel select bit 5 mask
.equ EVSYS_SWEVENTA_5_bp = 5             ; Software event on channel select bit 5 position
.equ EVSYS_SWEVENTA_6_bm = (1<<6)        ; Software event on channel select bit 6 mask
.equ EVSYS_SWEVENTA_6_bp = 6             ; Software event on channel select bit 6 position
.equ EVSYS_SWEVENTA_7_bm = (1<<7)        ; Software event on channel select bit 7 mask
.equ EVSYS_SWEVENTA_7_bp = 7             ; Software event on channel select bit 7 position

; EVSYS_CHANNEL0 masks
.equ EVSYS_CHANNEL_gm = 0xFF             ; Channel generator select group mask
.equ EVSYS_CHANNEL_gp = 0                ; Channel generator select group position
.equ EVSYS_CHANNEL_0_bm = (1<<0)         ; Channel generator select bit 0 mask
.equ EVSYS_CHANNEL_0_bp = 0              ; Channel generator select bit 0 position
.equ EVSYS_CHANNEL_1_bm = (1<<1)         ; Channel generator select bit 1 mask
.equ EVSYS_CHANNEL_1_bp = 1              ; Channel generator select bit 1 position
.equ EVSYS_CHANNEL_2_bm = (1<<2)         ; Channel generator select bit 2 mask
.equ EVSYS_CHANNEL_2_bp = 2              ; Channel generator select bit 2 position
.equ EVSYS_CHANNEL_3_bm = (1<<3)         ; Channel generator select bit 3 mask
.equ EVSYS_CHANNEL_3_bp = 3              ; Channel generator select bit 3 position
.equ EVSYS_CHANNEL_4_bm = (1<<4)         ; Channel generator select bit 4 mask
.equ EVSYS_CHANNEL_4_bp = 4              ; Channel generator select bit 4 position
.equ EVSYS_CHANNEL_5_bm = (1<<5)         ; Channel generator select bit 5 mask
.equ EVSYS_CHANNEL_5_bp = 5              ; Channel generator select bit 5 position
.equ EVSYS_CHANNEL_6_bm = (1<<6)         ; Channel generator select bit 6 mask
.equ EVSYS_CHANNEL_6_bp = 6              ; Channel generator select bit 6 position
.equ EVSYS_CHANNEL_7_bm = (1<<7)         ; Channel generator select bit 7 mask
.equ EVSYS_CHANNEL_7_bp = 7              ; Channel generator select bit 7 position

; EVSYS_CHANNEL1 masks
; Masks for EVSYS_CHANNEL already defined

; EVSYS_CHANNEL2 masks
; Masks for EVSYS_CHANNEL already defined

; EVSYS_CHANNEL3 masks
; Masks for EVSYS_CHANNEL already defined

