QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EA32def.inc
; SPI_CTRLB masks
.equ SPI_MODE_gm = 0x03                  ; SPI Mode group mask
.equ SPI_MODE_gp = 0                     ; SPI Mode group position
.equ SPI_MODE_0_bm = (1<<0)              ; SPI Mode bit 0 mask
.equ SPI_MODE_0_bp = 0                   ; SPI Mode bit 0 position
.equ SPI_MODE_1_bm = (1<<1)              ; SPI Mode bit 1 mask
.equ SPI_MODE_1_bp = 1                   ; SPI Mode bit 1 position
.equ SPI_SSD_bm = 0x04                   ; SPI Select Disable bit mask
.equ SPI_SSD_bp = 2                      ; SPI Select Disable bit position
.equ SPI_BUFWR_bm = 0x40                 ; Buffer Mode Wait for Receive bit mask
.equ SPI_BUFWR_bp = 6                    ; Buffer Mode Wait for Receive bit position
.equ SPI_BUFEN_bm = 0x80                 ; Buffer Mode Enable bit mask
.equ SPI_BUFEN_bp = 7                    ; Buffer Mode Enable bit position

; SPI_INTCTRL masks
.equ SPI_IE_bm = 0x01                    ; Interrupt Enable bit mask
.equ SPI_IE_bp = 0                       ; Interrupt Enable bit position
.equ SPI_SSIE_bm = 0x10                  ; SPI Select Trigger Interrupt Enable bit mask
.equ SPI_SSIE_bp = 4                     ; SPI Select Trigger Interrupt Enable bit position
.equ SPI_DREIE_bm = 0x20                 ; Data Register Empty Interrupt Enable bit mask
.equ SPI_DREIE_bp = 5                    ; Data Register Empty Interrupt Enable bit position
.equ SPI_TXCIE_bm = 0x40                 ; Transfer Complete Interrupt Enable bit mask
.equ SPI_TXCIE_bp = 6                    ; Transfer Complete Interrupt Enable bit position
.equ SPI_RXCIE_bm = 0x80                 ; Receive Complete Interrupt Enable bit mask
.equ SPI_RXCIE_bp = 7                    ; Receive Complete Interrupt Enable bit position

; SPI_INTFLAGS masks
.equ SPI_BUFOVF_bm = 0x01                ; Buffer Overflow bit mask
.equ SPI_BUFOVF_bp = 0                   ; Buffer Overflow bit position
.equ SPI_SSIF_bm = 0x10                  ; SPI Select Trigger Interrupt Flag bit mask
.equ SPI_SSIF_bp = 4                     ; SPI Select Trigger Interrupt Flag bit position
.equ SPI_DREIF_bm = 0x20                 ; Data Register Empty Interrupt Flag bit mask
.equ SPI_DREIF_bp = 5                    ; Data Register Empty Interrupt Flag bit position
.equ SPI_TXCIF_bm = 0x40                 ; Transfer Complete Interrupt Flag bit mask
.equ SPI_TXCIF_bp = 6                    ; Transfer Complete Interrupt Flag bit position
.equ SPI_WRCOL_bm = 0x40                 ; Write Collision bit mask
.equ SPI_WRCOL_bp = 6                    ; Write Collision bit position
.equ SPI_RXCIF_bm = 0x80                 ; Receive Complete Interrupt Flag bit mask
.equ SPI_RXCIF_bp = 7                    ; Receive Complete Interrupt Flag bit position
.equ SPI_IF_bm = 0x80                    ; Interrupt Flag bit mask
.equ SPI_IF_bp = 7                       ; Interrupt Flag bit position

; Prescaler select
.equ SPI_PRESC_DIV4_gc = (0x00<<1)       ; CLK_PER / 4
.equ SPI_PRESC_DIV16_gc = (0x01<<1)      ; CLK_PER / 16
.equ SPI_PRESC_DIV64_gc = (0x02<<1)      ; CLK_PER / 64
.equ SPI_PRESC_DIV128_gc = (0x03<<1)     ; CLK_PER / 128

; SPI Mode select
.equ SPI_MODE_0_gc = (0x00<<0)           ; SPI Mode 0
.equ SPI_MODE_1_gc = (0x01<<0)           ; SPI Mode 1
.equ SPI_MODE_2_gc = (0x02<<0)           ; SPI Mode 2
.equ SPI_MODE_3_gc = (0x03<<0)           ; SPI Mode 3


;*************************************************************************
;** SYSCFG - System Configuration Registers
;*************************************************************************

; SYSCFG_REVID masks
.equ SYSCFG_MINOR_gm = 0x0F              ; Minor Revision group mask
.equ SYSCFG_MINOR_gp = 0                 ; Minor Revision group position
.equ SYSCFG_MINOR_0_bm = (1<<0)          ; Minor Revision bit 0 mask
.equ SYSCFG_MINOR_0_bp = 0               ; Minor Revision bit 0 position
.equ SYSCFG_MINOR_1_bm = (1<<1)          ; Minor Revision bit 1 mask
.equ SYSCFG_MINOR_1_bp = 1               ; Minor Revision bit 1 position
.equ SYSCFG_MINOR_2_bm = (1<<2)          ; Minor Revision bit 2 mask
.equ SYSCFG_MINOR_2_bp = 2               ; Minor Revision bit 2 position
.equ SYSCFG_MINOR_3_bm = (1<<3)          ; Minor Revision bit 3 mask
.equ SYSCFG_MINOR_3_bp = 3               ; Minor Revision bit 3 position
.equ SYSCFG_MAJOR_gm = 0xF0              ; Major Revision group mask
.equ SYSCFG_MAJOR_gp = 4                 ; Major Revision group position
.equ SYSCFG_MAJOR_0_bm = (1<<4)          ; Major Revision bit 0 mask
.equ SYSCFG_MAJOR_0_bp = 4               ; Major Revision bit 0 position
.equ SYSCFG_MAJOR_1_bm = (1<<5)          ; Major Revision bit 1 mask
.equ SYSCFG_MAJOR_1_bp = 5               ; Major Revision bit 1 position
.equ SYSCFG_MAJOR_2_bm = (1<<6)          ; Major Revision bit 2 mask
.equ SYSCFG_MAJOR_2_bp = 6               ; Major Revision bit 2 position
.equ SYSCFG_MAJOR_3_bm = (1<<7)          ; Major Revision bit 3 mask
.equ SYSCFG_MAJOR_3_bp = 7               ; Major Revision bit 3 position

; SYSCFG_OCDMCTRL masks
.equ SYSCFG_OCDM_gm = 0xFF               ; OCD Message group mask
.equ SYSCFG_OCDM_gp = 0                  ; OCD Message group position
.equ SYSCFG_OCDM_0_bm = (1<<0)           ; OCD Message bit 0 mask
.equ SYSCFG_OCDM_0_bp = 0                ; OCD Message bit 0 position
.equ SYSCFG_OCDM_1_bm = (1<<1)           ; OCD Message bit 1 mask
.equ SYSCFG_OCDM_1_bp = 1                ; OCD Message bit 1 position
.equ SYSCFG_OCDM_2_bm = (1<<2)           ; OCD Message bit 2 mask
.equ SYSCFG_OCDM_2_bp = 2                ; OCD Message bit 2 position
.equ SYSCFG_OCDM_3_bm = (1<<3)           ; OCD Message bit 3 mask
.equ SYSCFG_OCDM_3_bp = 3                ; OCD Message bit 3 position
.equ SYSCFG_OCDM_4_bm = (1<<4)           ; OCD Message bit 4 mask
.equ SYSCFG_OCDM_4_bp = 4                ; OCD Message bit 4 position
.equ SYSCFG_OCDM_5_bm = (1<<5)           ; OCD Message bit 5 mask
.equ SYSCFG_OCDM_5_bp = 5                ; OCD Message bit 5 position
.equ SYSCFG_OCDM_6_bm = (1<<6)           ; OCD Message bit 6 mask
.equ SYSCFG_OCDM_6_bp = 6                ; OCD Message bit 6 position
.equ SYSCFG_OCDM_7_bm = (1<<7)           ; OCD Message bit 7 mask
.equ SYSCFG_OCDM_7_bp = 7                ; OCD Message bit 7 position

; SYSCFG_OCDMSTATUS masks
.equ SYSCFG_VALID_bm = 0x01              ; OCD Message Valid bit mask
.equ SYSCFG_VALID_bp = 0                 ; OCD Message Valid bit position


;*************************************************************************
;** TCA - 16-bit Timer/Counter Type A
;*************************************************************************

; TCA_SINGLE_CTRLA masks
.equ TCA_SINGLE_ENABLE_bm = 0x01         ; Module Enable bit mask
.equ TCA_SINGLE_ENABLE_bp = 0            ; Module Enable bit position
.equ TCA_SINGLE_CLKSEL_gm = 0x0E         ; Clock Selection group mask
.equ TCA_SINGLE_CLKSEL_gp = 1            ; Clock Selection group position
.equ TCA_SINGLE_CLKSEL_0_bm = (1<<1)     ; Clock Selection bit 0 mask
.equ TCA_SINGLE_CLKSEL_0_bp = 1          ; Clock Selection bit 0 position
.equ TCA_SINGLE_CLKSEL_1_bm = (1<<2)     ; Clock Selection bit 1 mask
.equ TCA_SINGLE_CLKSEL_1_bp = 2          ; Clock Selection bit 1 position
.equ TCA_SINGLE_CLKSEL_2_bm = (1<<3)     ; Clock Selection bit 2 mask
.equ TCA_SINGLE_CLKSEL_2_bp = 3          ; Clock Selection bit 2 position
.equ TCA_SINGLE_RUNSTDBY_bm = 0x80       ; Run in Standby bit mask
.equ TCA_SINGLE_RUNSTDBY_bp = 7          ; Run in Standby bit position

